01  WS-AREA.         
05  WS-DATE PIC 9(8). 
05  WS-TIME PIC 9(6). 

PROCEDURE DIVISION. 
....
MOVE FUNCTION CURRENT-DATE TO WS-DATE
MOVE FUNCTION CURRENT-TIME TO WS-TIME
....